#+STARTUP: showall

#+latex_class: article
#+LATEX: \setlength{\parindent}{0em}
#+LATEX_HEADER: \usepackage{comment}
#+LATEX_HEADER: \usepackage{gentium}
#+LATEX_HEADER: \usepackage{array}
#+LATEX_HEADER: \usepackage{tabularx}
#+LaTeX_HEADER: \usepackage[top=1in, bottom=1.25in, left=1.25in, right=1.25in]{geometry}
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+options: num:2 toc:nil

#+attr_latex: :align c
| \Large SSN College of Engineering (Autonomous)  |
| (Affiliated to Anna University, Chennai)        |
|                                                 |
| \Large *R2021 CURRICULUM* |
|                                                 |
#+attr_latex: :environment longtable :align @{}p{.04\textwidth}p{.06\textwidth}p{.5\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}
#+name: curriculum
|    |      |                                                                    |     |     |    |   |    |     |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
| No | Code | Title                                                              | Cat | Hrs |  L | T |  P |   C |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester I*                                                       |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Technical English                                                  | HS  |   4 |  2 | 0 |  2 |   3 |
|  2 |      | Algebra and Calculus                                               | BS  |   4 |  3 | 1 |  0 |   4 |
|  3 |      | Engineering Physics                                                | BS  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Engineering Chemistry                                              | BS  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Problem Solving and Programming in Python                          | ES  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Engineering Graphics                                               | ES  |   5 |  1 | 0 |  4 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Physics and Chemistry Lab                                          | BS  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Programming in Python Lab                                          | ES  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  28 | 15 | 1 | 12 | 22. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester II*                                                      |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Complex Functions and Laplace Transforms                           | BS  |   4 |  3 | 1 |  0 |   4 |
|  2 |      | Basic Electrical and Electronics Engineering                       | ES  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Engineering Fundamentals and Practices                             | ES  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Environmental Science                                              | BS  |   3 |  3 | 0 |  0 |   0 |
|  5 |      | Humanities Elective I                                              | HS  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Foundations of Data Science                                        | ES  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | EFP Lab                                                            | ES  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Design Thinking and Engineering Practices Lab                      | ES  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  25 | 18 | 1 |  6 | 19. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester III*                                                     |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Discrete Mathematics                                               | BS  |   4 |  3 | 1 |  0 |   4 |
|  2 |      | Universal Human Values II                                          | HS  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Digital Principles and System Design                               | ES  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Data Structures                                                    | PC  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Object Oriented Programming                                        | PC  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  6 |      | Digital Design Lab                                                 | ES  |   3 |  0 | 0 |  3 | 1.5 |
|  7 |      | Data Structures Lab                                                | PC  |   4 |  0 | 0 |  4 |   2 |
|  8 |      | Object Oriented Programming Lab                                    | PC  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  26 | 15 | 1 | 10 | 21. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester IV*                                                      |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Probability and Statistics                                         | BS  |   4 |  3 | 1 |  0 |   4 |
|  2 |      | Essence of Indian Traditional Knowledge / Indian Constitution (MC) | HS  |   3 |  3 | 0 |  0 |   0 |
|  3 |      | Computer Organization and Architecture                             | PC  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Operating Systems                                                  | PC  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Design and Analysis of Algorithms                                  | PC  |   5 |  3 | 0 |  2 |   4 |
|  6 |      | Database Management Systems (EFP)                                  | PC  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Operating Systems Lab                                              | PC  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Database Lab (EFP)                                                 | PC  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  27 | 18 | 1 |  8 | 20. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester V*                                                       |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Computer Networks                                                  | PC  |   3 |  3 | 0 |  0 |   3 |
|  2 |      | Microprocessors and Interfacing                                    | PC  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Theory of Computation                                              | PC  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Software Engineering                                               | PC  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Professional Elective 1                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Management Elective                                                | HS  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Networks Lab                                                       | PC  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Microprocessors Lab                                                | PC  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  24 | 18 | 0 |  6 | 21. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester VI*                                                      |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Internet Programming                                               | PC  |   3 |  3 | 0 |  0 |   3 |
|  2 |      | Data Security and Privacy                                          | PC  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Machine Learning (EFP)                                             | PC  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Artificial Intelligence                                            | PC  |   5 |  3 | 0 |  2 |   4 |
|  5 |      | Professional Elective 2                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Open Elective 1                                                    | OE  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Internet Programming Lab                                           | PC  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Machine Learning Lab (EFP)                                         | PC  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  26 | 18 | 0 |  8 | 22. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester VII*                                                     |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Distributed Systems                                                | PC  |   3 |  3 | 0 |  0 |   3 |
|  2 |      | Software Architecture                                              | PC  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Compiler Design                                                    | PC  |   5 |  3 | 0 |  2 |   4 |
|  4 |      | Professional Elective 3                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Professional Elective 4                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Professional Elective 5                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Project Work Phase 1                                               | EEC |   6 |  0 | 0 |  6 |   3 |
|  8 |      | Industrial Training / Internship                                   | EEC |   0 |  0 | 0 |  0 |   2 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  26 | 18 | 0 |  8 |  24 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester VIII*                                                    |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Professional Elective 6                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  2 |      | Open Elective 2                                                    | OE  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  3 |      | Project Work Phase 2                                               | EEC |  16 |  0 | 0 | 16 |   8 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | Total                                                              |     |  22 |  6 | 0 | 16 |  14 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Grand Total*                                                      |     |     |    |   |    | 163 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
#+TBLFM: @14$5..@14$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @26$5..@26$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @38$5..@38$>=vsum(@-II+3..@-5)+vsum(@-3..@-1)
#+TBLFM: @50$5..@50$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @62$5..@62$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @74$5..@74$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @86$5..@86$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @93$5..@93$>=vsum(@-II+3..@-3)+vsum(@-1..@-1)
#+TBLFM: @94$9=@III+1+@IIIII+1+@IIIIIII+1+@IIIIIIIII+1+@IIIIIIIIIII+1+@IIIIIIIIIIIII+1+@IIIIIIIIIIIIIII+1+@IIIIIIIIIIIIIIIII+1;%3d


#+latex: \newpage
#+attr_latex: :environment longtable :align @{}p{.04\textwidth}p{.06\textwidth}p{.5\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}
|    |       |                                           |     |     |   |   |   |   |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
| No | Code  | Title                                     | Cat | Hrs | L | T | P | C |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 1*                 |     |     |   |   |   |   |
|  1 | PE101 | Big Data Analytics/Technologies           | PC  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE102 | Software Testing                          | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE103 | Image Processing and Analysis             | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE104 | Statistical Inference                     | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE105 | Introduction to Cryptographic Techniques  | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE106 | Ethical Hacking                           | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE107 | Functional Programming                    | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 2*                 |     |     |   |   |   |   |
|  1 | PE201 | Cloud Computing                           | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE202 | Big Data Management                       | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE203 | Software Project Management               | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE204 | Probablistic Graphical Models             | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE205 | Time Series Analysis and Forecasting      | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE206 | Cyber Forensics                           | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE207 | Wireless and Adhoc Networks               | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 3*                 |     |     |   |   |   |   |
|  1 | PE301 | Bayesian Data Analysis (AI&DS)            | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE302 | Internet of Things                        | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE303 | Service Oriented Architecture             | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE304 | Data Warehousing and Data Mining (BDMA)   | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE305 | Deep Learning                             | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE306 | Multicore Architectures and GPU Computing | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE307 | Network and Server Security               | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 4*                 |     |     |   |   |   |   |
|  1 | PE401 | Healthcare  Analytics                     | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE402 | User Experience Design                    | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE403 | Social Network Analysis                   | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE404 | Computer Vision                           | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE405 | Blockchain Technologies                   | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE406 | Embedded systems                          | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE407 | Graphics and Multimedia                   | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 5*                 |     |     |   |   |   |   |
|  1 | PE501 | Bioinformatics                            | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE502 | Agile Methodologies                       | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE503 | Natural Language Processing               | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE504 | Robotics                                  | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE505 | Speech Processing and Synthesis           | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE506 | Mobile computing                          | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE507 | Mobile and Wireless Security              | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 6*                 |     |     |   |   |   |   |
|  1 | PE601 | Business Analytics                        | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE602 | Formal System Verification                | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE603 | Object Oriented Analysis and Design       | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE604 | Information Retrieval Techniques (BDMA)   | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE605 | Reinforcement Learning                    | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE606 | Software Defined Networks                 | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE607 | Parallel Algorithms                       | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Open Electives 1*                        |     |     |   |   |   |   |
|  1 | OE1   | Introduction to Data Structures           | OE  |   4 | 2 | 0 | 2 | 3 |
|  2 | OE2   | Object Oriented Programming Techniques    | OE  |   4 | 2 | 0 | 2 | 3 |
|  3 | OE3   | Problem Solving and Programming in C      | OE  |   4 | 2 | 0 | 2 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Open Electives 2*                        |     |     |   |   |   |   |
|  4 | OE4   | Introduction to Big Data Analytics        | OE  |   4 | 2 | 0 | 2 | 3 |
|  5 | OE5   | Machine Learning Applications             | OE  |   4 | 2 | 0 | 2 | 3 |
|  6 | OE6   | Web Technology                            | OE  |   4 | 2 | 0 | 2 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|

** COMMENT Specialization
| PE1                                                         | PE2                                                        | PE3                                                                   | PE4                                     | PE5                                                                  | PE6                                                            |
+-------------------------------------------------------------+------------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------+----------------------------------------------------------------------+----------------------------------------------------------------|
| Semester 5                                                  | Semester 6                                                 | Semester 7                                                            | Semester 7                              | Semester 7                                                           | Semester 8                                                     |
+-------------------------------------------------------------+------------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------+----------------------------------------------------------------------+----------------------------------------------------------------|
| Big Data Technologies                                       | Cloud Computing Big Data Management                        | Bayesian Data Analysis (AI&DS) Internet of Things                     | Healthcare  Analytics                   | Bio Informatics                                                      | Business Analytics                                             |
| Software Testing                                            | Software Project Management                                | Service Oriented Architecture                                         | User Experience Design                  | Agile Methodologies                                                  | Formal System Verification Software Architectures              |
| Image Processing and Analysis Probablistic Graphical Models | Statistical Inference Time Series Analysis and Forecasting | Data Warehousing and Data Mining (BDMA) Deep Learning                 | Social Network Analysis Computer Vision | Natural Language Processing Robotics Speech Processing and Synthesis | Information Retrieval Techniques (BDMA) Reinforcement Learning |
| Cryptographic techniques Ethical Hacking                    | Cyber Forensics Wireless and Adhoc Networks                | Multicore Architectures and GPU Computing Network and Server Security | Blockchain Technologies                 | Mobile computing Mobile and Wireless Security                        | Software Defined Networks                                      |

** Specialization
# +latex:  \hyphenpenalty=10000
#+latex: \newcolumntype{Y}{>{\small\raggedright\arraybackslash}X}
#+attr_latex: :environment tabularx :width \textwidth :align cYYYY
| PE | /Big Data Management and Analytics/ | /Software Engineering and Architectures/ | /AI and Data Science/                    | /Networks and Security/                   |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  1 | Big Data Technologies               | Software Testing                         | Image Processing and Analysis,           | Cryptographic Techniques,                 |
|    |                                     |                                          | Probablistic Graphical Models            | Ethical Hacking                           |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  2 | Cloud Computing,                    | Software Project Management              | Statistical Inference,                   | Cyber Forensics,                          |
|    | Big Data Management                 |                                          | Time Series Analysis and Forecasting     | Wireless and Adhoc Networks               |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  3 | Bayesian Data Analysis (AIDS),      | Service Oriented Architecture            | Data Warehousing and Data Mining (BDMA), | Multicore Architecture and GPU Computing, |
|    | Internet of Things                  |                                          | Deep Learning                            | Network and Server Security               |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  4 | Healthcare  Analytics               | User Experience Design                   | Social Network Analysis,                 | Blockchain Technologies                   |
|    |                                     |                                          | Computer Vision                          |                                           |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  5 | Bio Informatics                     | Agile Methodologies                      | Natural Language Processing,             | Mobile Computing,                         |
|    |                                     |                                          | Robotics,                                | Mobile and Wireless Security              |
|    |                                     |                                          | Speech Processing and Synthesis          |                                           |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  6 | Business Analytics                  | Formal System Verification               | Information Retrieval Techniques (BDMA)  | Software Defined Networks                 |
|    |                                     | Object Orineted Analysis and Design                                         |                                          |                                           |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
